app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = 14 AND "ratings"."track_id" = 23 LIMIT 1
UPDATE "ratings" SET "value" = 2, "updated_at" = '2012-02-02 03:41:50.140128' WHERE "ratings"."id" = 2
---
  def update
    #@track = Track.find_by_id(params[:id])
    # I'm not sure if this'll work (track_id in params[:rating] hash?)
    @rating = current_user.ratings.find_by_track_id(params[:rating][:track_id])
    if @rating.update_attributes(params[:rating])