app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "password_hash", "password_salt", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		if verify_recaptcha(model: @user, message: "reCaptcha error") && @user.save